#include <iostream>

struct Union {
    union {
        float a;
        int b;
    };
};

int main() {
    Union u;
    u.a = 2.0f;
    std::cout<<u.a <<", "<<u.b<<std::endl;
    return 0;
}

/*
    union-ի բոլոր անդամները օգտագործում են նույն հիշողության հասցեն՝ այսինքն իրար վրա են նստում։
    Այս ծրագիրի արդյունքը կլինի
    2, 1073741824
    IEEE-754 ստանդարտով (2.0f)-ը ներկայացվում է որպես 01000000000000000000000000000000
    Երբ տպում ենք u.a-ն ծրագիրը այդ բիթերը կարդալու է և մեկնաբանելու է որպես float:
    Սակայն, u.b-ի դեպքում այդ նույն բիթերը մեկնաբանվելու են որպես int, իսկ 
    (01000000000000000000000000000000)₂=(1073741824)₁₀ = 2³⁰
    Այդ պատճառով ենք ունենում նման output:
*/